# DataFrame Manipulation

## 1. Merging DataFrames

Prepare dataset.

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

### 1.1 Adding columns.

In [3]:
df['Date'] = ['December 1', 'January 1', 'Mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     Mid-May

* Adding values to specific rows in a chosen column.

In [5]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December 1', 2: 'mid-May'})
adf

     index  Cost Item Purchased   Name        Date
0  Store 1  22.5         Sponge  Chris  December 1
1  Store 1   2.5   Kitty Litter  Kevyn         NaN
2  Store 2   5.0          Spoon  Filip     mid-May

<font colour = 'red'>**Note:**</font> if no value is given to a row, <i>NaN</i> will be assigned.

### 1.2 Merging Function.

Applying <i>Merge</i> function to join tables.
<br>
Prepare two tables:

In [6]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

* Merging by <b> Index </b>

In [10]:
pd.merge(staff_df,       # Table 1
         student_df,     # Table 2
         how = 'outer',  # outer/inner/left/right
         left_index = True, right_index = True # whether join by Index.
        )

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

* Merging on <b>specific (multiple) columns </b>

In [12]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])
staff_df
student_df
pd.merge(staff_df, 
         student_df, 
         how='inner', 
         left_on=['First Name','Last Name'], 
         right_on=['First Name','Last Name']
        )

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering